{"id": {"name": "iD Tech", "date": {"start": "2022-05-02", "end": "2022-08-02"}, "url": "id", "markdown": "As an online instructor for iD Tech Camps, I wrote individualized curriculum for students in one-on-one sessions. While I have no intention of retaining that job indefinitely, it was definitely some of the most fun I've ever had at work. Working with students (especially younger students) who were intimidated by Computer Science was a joy as I showed them how intuitive the field could really be. iD Tech attempted to work with students where they were at, so a lot of sessions were held within Roblox or Minecraft or modding tools that students would actually be interested in learning about. This work was done remotely, an additional challenge when working with younger students, as I was often working with students who were younger than 10 years old."}, "lsa": {"name": "Local Search Appeal", "date": {"start": "2018-07-02", "end": "2023-06-02"}, "url": "lsa", "markdown": "LSA is a smaller company with 4 employees at time of writing, which gave me a large variety of work as I was one half of the entire operations team. This meant that there were times that I was directly responsible for a lot of site infrastructure: at many points being the sole maintainer for many of the 200+ websites under their purview, doing social media posting, using photoshop to modify site graphics and finally working to automate some of the processes that were the most time-consuming through web scraping and automated HTTP messages.\n\nThroughout most of this work, I was given almost complete autonomy over what tools were used and how I completed the task. From that I gained a very practical appreciation for meeting the goals of a project by the most effective means, and not over or underengineering a solution to them."}, "me": {"name": "Myself", "date": {"start": "2001-10-05", "end": "present"}, "url": "me", "markdown": "My name is Demi Willison. I just graduated in May of 2023 with a Bachelors in Computer Science from Sonoma State University and I've been programming since 2011. Through my five years at Local Search Appeal, I managed and updated hundreds of websites, made/updated HTML/CSS/JavaScript according to the additional needs of our clients, and wrote helper scripts in Python to automate our workflows. In college, I wrote upper-division curriculum for Physics majors as a freshman. Currently, while I am looking for work, I am continuing my senior capstone work with Dr. Ravikumar, with the plan to submit our work to conferences. "}, "ssu": {"name": "Sonoma State University", "date": {"start": "2019-08-02", "end": "2023-05-02"}, "url": "ssu", "markdown": "My time at SSU was great, as I had been dreaming about taking classes almost entirely about Computer Science for a long time. I had done a lot of programming work beforehand, but a formal education was definitely both necessary and beneficial for my ability to work in the future. Some courses I want to highlight (recieved an A/A- in all listed courses):\n\n- Data Structures\n- Software Design & Development\n- Theory of Computation\n- Operating Systems\n- Senior Research Project\n- Computer Architecture"}}